package com.cinema.client.data.movie;

import java.util.ArrayList;
import java.util.List;

public class MoviesRepository {
    public static List<Movie> generateNewMovies(){
        List<Movie> movies = new ArrayList<>();

        movies.add(new Movie(
                //title
                "Шазам!",
                //shortDescription
                "Каждый из нас в душе супергерой, однако надо немного магии, чтобы раскрыть его. Воспитанному улицей 14-летнему Билли Батсону повезло: он способен превращаться во взрослого супергероя Шазама.",
                //full Description
                "Каждый из нас в душе супергерой, однако надо немного магии, чтобы раскрыть его. Воспитанному улицей 14-летнему Билли Батсону повезло: он способен превращаться во взрослого супергероя Шазама.",
                //poster image url
                "https://multiplex.ua/images/7f/67/7f67319a6340bb8dfb280e3a75c3c867.jpeg"
        ));

        movies.add(new Movie(
                //title
                "Шазам!",
                //shortDescription
                "Каждый из нас в душе супергерой, однако надо немного магии, чтобы раскрыть его. Воспитанному улицей 14-летнему Билли Батсону повезло: он способен превращаться во взрослого супергероя Шазама.",
                //full Description
                "Каждый из нас в душе супергерой, однако надо немного магии, чтобы раскрыть его. Воспитанному улицей 14-летнему Билли Батсону повезло: он способен превращаться во взрослого супергероя Шазама.",
                //poster image url
                "https://multiplex.ua/images/7f/67/7f67319a6340bb8dfb280e3a75c3c867.jpeg"
        ));

        movies.add(new Movie(
                //title
                "Шазам!",
                //shortDescription
                "Каждый из нас в душе супергерой, однако надо немного магии, чтобы раскрыть его. Воспитанному улицей 14-летнему Билли Батсону повезло: он способен превращаться во взрослого супергероя Шазама.",
                //full Description
                "Каждый из нас в душе супергерой, однако надо немного магии, чтобы раскрыть его. Воспитанному улицей 14-летнему Билли Батсону повезло: он способен превращаться во взрослого супергероя Шазама.",
                //poster image url
                "https://multiplex.ua/images/7f/67/7f67319a6340bb8dfb280e3a75c3c867.jpeg"
        ));

        movies.add(new Movie(
                //title
                "Шазам!",
                //shortDescription
                "Каждый из нас в душе супергерой, однако надо немного магии, чтобы раскрыть его. Воспитанному улицей 14-летнему Билли Батсону повезло: он способен превращаться во взрослого супергероя Шазама.",
                //full Description
                "Каждый из нас в душе супергерой, однако надо немного магии, чтобы раскрыть его. Воспитанному улицей 14-летнему Билли Батсону повезло: он способен превращаться во взрослого супергероя Шазама.",
                //poster image url
                "https://multiplex.ua/images/7f/67/7f67319a6340bb8dfb280e3a75c3c867.jpeg"
        ));

        movies.add(new Movie(
                //title
                "Шазам!",
                //shortDescription
                "Каждый из нас в душе супергерой, однако надо немного магии, чтобы раскрыть его. Воспитанному улицей 14-летнему Билли Батсону повезло: он способен превращаться во взрослого супергероя Шазама.",
                //full Description
                "Каждый из нас в душе супергерой, однако надо немного магии, чтобы раскрыть его. Воспитанному улицей 14-летнему Билли Батсону повезло: он способен превращаться во взрослого супергероя Шазама.",
                //poster image url
                "https://multiplex.ua/images/7f/67/7f67319a6340bb8dfb280e3a75c3c867.jpeg"
        ));

        movies.add(new Movie(
                //title
                "Шазам!",
                //shortDescription
                "Каждый из нас в душе супергерой, однако надо немного магии, чтобы раскрыть его. Воспитанному улицей 14-летнему Билли Батсону повезло: он способен превращаться во взрослого супергероя Шазама.",
                //full Description
                "Каждый из нас в душе супергерой, однако надо немного магии, чтобы раскрыть его. Воспитанному улицей 14-летнему Билли Батсону повезло: он способен превращаться во взрослого супергероя Шазама.",
                //poster image url
                "https://multiplex.ua/images/7f/67/7f67319a6340bb8dfb280e3a75c3c867.jpeg"
        ));

        return movies;
    }
}
